app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY name LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order("name").paginate(:per_page => 15, page: params[:page])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 51]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 51]]
---
  def destroy
    User.find(params[:id]).destroy